app/views/welcomes/index.html.erb

                          <h2 class="lead"><b><%= tweet.user_name%></b></h2>
                          <p class="text-muted text-sm"><b>Tweet Text: </b> <%= tweet.tweet_text.first(80) %> </p>
---
SELECT "tweets".* FROM "tweets"