app/controllers/sessions_controller.rb

  def create
    @user = User.find_or_create_from_auth_hash(auth_hash)
---
INSERT INTO "users" ("provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "twitter"], ["uid", "1218842252690124800"], ["created_at", "2020-04-11 15:06:00.270567"], ["updated_at", "2020-04-11 15:06:00.270567"]]