app/controllers/tweets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1 AND "tweets"."tweet_id" = $2 LIMIT $3  [["user_id", 1], ["tweet_id", "1252584839418527745"], ["LIMIT", 1]]
---
	def create
		@user = User.find_by(id: session[:user_id])
		client = Twitter::REST::Client.new do |config|
		  config.consumer_key        = ENV['TWITTER_KEY']
		  config.consumer_secret     = ENV['TWITTER_SECRET']
		  config.access_token        = @user.token
      config.access_token_secret = @user.secret
		end
    unless params[:tweet][:user_profile_url].blank?