app/models/tweet.rb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1 AND "tweets"."tweet_id" = $2 LIMIT $3  [["user_id", 1], ["tweet_id", "1252590028800159744"], ["LIMIT", 1]]
UPDATE "tweets" SET "tweet_json" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3
---
	def self.save_tweet(tweet,user)
    tweet = JSON.parse(tweet.to_json)
    new_t = user.tweets.find_or_initialize_by(tweet_id: tweet["id"])
    new_t.tweet_created_at = tweet["created_at"]
    new_t.tweet_text =  tweet["text"]
    new_t.tweet_json = tweet
    new_t.user_name = tweet["user"]["name"]
    new_t.tweet_user_id =  tweet["user"]["id"]
    new_t.user_profile_url = tweet["user"]["profile_image_url_https"]
    new_t.tweet_media = tweet["extended_entities"]["media"][0]["media_url_https"] unless tweet["extended_entities"].blank?
	  new_t.save!

INSERT INTO "tweets" ("tweet_id", "tweet_created_at", "tweet_text", "tweet_json", "user_name", "tweet_user_id", "user_profile_url", "tweet_media", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "users".* FROM "users"
---
  def self.save_all_tweets
    users = User.all