app/models/user.rb

INSERT INTO "users" ("provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "twitter"], ["uid", "1218842252690124800"], ["created_at", "2020-04-11 15:06:00.270567"], ["updated_at", "2020-04-11 15:06:00.270567"]]
SELECT "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["provider", "twitter"], ["uid", "1218842252690124800"], ["LIMIT", 1]]
UPDATE "users" SET "profile_image" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["profile_image", "http://pbs.twimg.com/profile_images/1248990982281936896/lCkfJF9t_normal.png"], ["updated_at", "2020-04-11 15:07:37.466956"], ["id", 1]]
---
	def self.find_or_create_from_auth_hash(auth_hash)
    user = where(provider: auth_hash.provider, uid: auth_hash.uid).first_or_create
    user.update(
      name: auth_hash.info.nickname,
      profile_image: auth_hash.info.image,
      token: auth_hash.credentials.token,
      secret: auth_hash.credentials.secret
    )